HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxXbar_reg.h
/**
 * \file IfxXbar_reg.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC29X_UM_V1.1.R1
 * Specification: tc29x_um_v1.1p4_SFR_OPEN_MARKET.xml (Revision: UM_V1.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Xbar_Cfg Xbar address
 * \ingroup IfxLld_Xbar
 * 
 * \defgroup IfxLld_Xbar_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Xbar_Cfg
 * 
 * \defgroup IfxLld_Xbar_Cfg_Xbar 2-XBAR
 * \ingroup IfxLld_Xbar_Cfg
 * 
 */
#ifndef IFXXBAR_REG_H
#define IFXXBAR_REG_H 1
/******************************************************************************/
#include "IfxXbar_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Xbar_Cfg_BaseAddress
 * \{  */

/** \\brief  XBAR object */
#define MODULE_XBAR /*lint --e(923)*/ ((*(Ifx_XBAR*)0xF8700000u))
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Xbar_Cfg_Xbar
 * \{  */

/** \\brief  4FC, Access Enable Register 0 */
#define XBAR_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_XBAR_ACCEN0*)0xF87004FCu)

/** \\brief  4F8, Access Enable Register 1 */
#define XBAR_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_XBAR_ACCEN1*)0xF87004F8u)

/** \\brief  2C4, Arbiter Control Register 10 */
#define XBAR_ARBCON10 /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBCON10*)0xF87002C4u)

/** \\brief  44, Arbiter Control Register */
#define XBAR_ARBITER0_ARBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBCON*)0xF8700044u)

/** Alias (User Manual Name) for XBAR_ARBITER0_ARBCON.
* To use register names with standard convension, please use XBAR_ARBITER0_ARBCON.
*/
#define	XBAR_ARBCON0	(XBAR_ARBITER0_ARBCON)

/** \\brief  5C, Debug Address Register */
#define XBAR_ARBITER0_DBADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER0_DBADD*)0xF870005Cu)

/** Alias (User Manual Name) for XBAR_ARBITER0_DBADD.
* To use register names with standard convension, please use XBAR_ARBITER0_DBADD.
*/
#define	XBAR_DBADD0	(XBAR_ARBITER0_DBADD)

/** \\brief  58, Debug Control Register */
#define XBAR_ARBITER0_DBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_DBCON*)0xF8700058u)

/** Alias (User Manual Name) for XBAR_ARBITER0_DBCON.
* To use register names with standard convension, please use XBAR_ARBITER0_DBCON.
*/
#define	XBAR_DBCON0	(XBAR_ARBITER0_DBCON)

/** \\brief  60, Debug Mask Address Register */
#define XBAR_ARBITER0_DBMADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER0_DBMADD*)0xF8700060u)

/** Alias (User Manual Name) for XBAR_ARBITER0_DBMADD.
* To use register names with standard convension, please use XBAR_ARBITER0_DBMADD.
*/
#define	XBAR_DBMADD0	(XBAR_ARBITER0_DBMADD)

/** \\brief  54, Error/Debug Capture Register */
#define XBAR_ARBITER0_ERR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERR*)0xF8700054u)

/** Alias (User Manual Name) for XBAR_ARBITER0_ERR.
* To use register names with standard convension, please use XBAR_ARBITER0_ERR.
*/
#define	XBAR_ERR0	(XBAR_ARBITER0_ERR)

/** \\brief  50, Error/Debug Address Capture Register */
#define XBAR_ARBITER0_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERRADDR*)0xF8700050u)

/** Alias (User Manual Name) for XBAR_ARBITER0_ERRADDR.
* To use register names with standard convension, please use XBAR_ARBITER0_ERRADDR.
*/
#define	XBAR_ERRADDR0	(XBAR_ARBITER0_ERRADDR)

/** \\brief  48, Arbiter Priority Register */
#define XBAR_ARBITER0_PRIOH /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOH*)0xF8700048u)

/** Alias (User Manual Name) for XBAR_ARBITER0_PRIOH.
* To use register names with standard convension, please use XBAR_ARBITER0_PRIOH.
*/
#define	XBAR_PRIOH0	(XBAR_ARBITER0_PRIOH)

/** \\brief  4C, Arbiter Priority Register */
#define XBAR_ARBITER0_PRIOL /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOL*)0xF870004Cu)

/** Alias (User Manual Name) for XBAR_ARBITER0_PRIOL.
* To use register names with standard convension, please use XBAR_ARBITER0_PRIOL.
*/
#define	XBAR_PRIOL0	(XBAR_ARBITER0_PRIOL)

/** \\brief  84, Arbiter Control Register */
#define XBAR_ARBITER1_ARBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBCON*)0xF8700084u)

/** Alias (User Manual Name) for XBAR_ARBITER1_ARBCON.
* To use register names with standard convension, please use XBAR_ARBITER1_ARBCON.
*/
#define	XBAR_ARBCON1	(XBAR_ARBITER1_ARBCON)

/** \\brief  9C, Debug Address Register */
#define XBAR_ARBITER1_DBADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER1_DBADD*)0xF870009Cu)

/** Alias (User Manual Name) for XBAR_ARBITER1_DBADD.
* To use register names with standard convension, please use XBAR_ARBITER1_DBADD.
*/
#define	XBAR_DBADD1	(XBAR_ARBITER1_DBADD)

/** \\brief  98, Debug Control Register */
#define XBAR_ARBITER1_DBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_DBCON*)0xF8700098u)

/** Alias (User Manual Name) for XBAR_ARBITER1_DBCON.
* To use register names with standard convension, please use XBAR_ARBITER1_DBCON.
*/
#define	XBAR_DBCON1	(XBAR_ARBITER1_DBCON)

/** \\brief  A0, Debug Mask Address Register */
#define XBAR_ARBITER1_DBMADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER1_DBMADD*)0xF87000A0u)

/** Alias (User Manual Name) for XBAR_ARBITER1_DBMADD.
* To use register names with standard convension, please use XBAR_ARBITER1_DBMADD.
*/
#define	XBAR_DBMADD1	(XBAR_ARBITER1_DBMADD)

/** \\brief  94, Error/Debug Capture Register */
#define XBAR_ARBITER1_ERR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERR*)0xF8700094u)

/** Alias (User Manual Name) for XBAR_ARBITER1_ERR.
* To use register names with standard convension, please use XBAR_ARBITER1_ERR.
*/
#define	XBAR_ERR1	(XBAR_ARBITER1_ERR)

