HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxXbar_reg.h
/** \\brief  90, Error/Debug Address Capture Register */
#define XBAR_ARBITER1_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERRADDR*)0xF8700090u)

/** Alias (User Manual Name) for XBAR_ARBITER1_ERRADDR.
* To use register names with standard convension, please use XBAR_ARBITER1_ERRADDR.
*/
#define	XBAR_ERRADDR1	(XBAR_ARBITER1_ERRADDR)

/** \\brief  88, Arbiter Priority Register */
#define XBAR_ARBITER1_PRIOH /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOH*)0xF8700088u)

/** Alias (User Manual Name) for XBAR_ARBITER1_PRIOH.
* To use register names with standard convension, please use XBAR_ARBITER1_PRIOH.
*/
#define	XBAR_PRIOH1	(XBAR_ARBITER1_PRIOH)

/** \\brief  8C, Arbiter Priority Register */
#define XBAR_ARBITER1_PRIOL /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOL*)0xF870008Cu)

/** Alias (User Manual Name) for XBAR_ARBITER1_PRIOL.
* To use register names with standard convension, please use XBAR_ARBITER1_PRIOL.
*/
#define	XBAR_PRIOL1	(XBAR_ARBITER1_PRIOL)

/** \\brief  C4, Arbiter Control Register */
#define XBAR_ARBITER2_ARBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBCON*)0xF87000C4u)

/** Alias (User Manual Name) for XBAR_ARBITER2_ARBCON.
* To use register names with standard convension, please use XBAR_ARBITER2_ARBCON.
*/
#define	XBAR_ARBCON2	(XBAR_ARBITER2_ARBCON)

/** \\brief  DC, Debug Address Register */
#define XBAR_ARBITER2_DBADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER2_DBADD*)0xF87000DCu)

/** Alias (User Manual Name) for XBAR_ARBITER2_DBADD.
* To use register names with standard convension, please use XBAR_ARBITER2_DBADD.
*/
#define	XBAR_DBADD2	(XBAR_ARBITER2_DBADD)

/** \\brief  D8, Debug Control Register */
#define XBAR_ARBITER2_DBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_DBCON*)0xF87000D8u)

/** Alias (User Manual Name) for XBAR_ARBITER2_DBCON.
* To use register names with standard convension, please use XBAR_ARBITER2_DBCON.
*/
#define	XBAR_DBCON2	(XBAR_ARBITER2_DBCON)

/** \\brief  E0, Debug Mask Address Register */
#define XBAR_ARBITER2_DBMADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER2_DBMADD*)0xF87000E0u)

/** Alias (User Manual Name) for XBAR_ARBITER2_DBMADD.
* To use register names with standard convension, please use XBAR_ARBITER2_DBMADD.
*/
#define	XBAR_DBMADD2	(XBAR_ARBITER2_DBMADD)

/** \\brief  D4, Error/Debug Capture Register */
#define XBAR_ARBITER2_ERR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERR*)0xF87000D4u)

/** Alias (User Manual Name) for XBAR_ARBITER2_ERR.
* To use register names with standard convension, please use XBAR_ARBITER2_ERR.
*/
#define	XBAR_ERR2	(XBAR_ARBITER2_ERR)

/** \\brief  D0, Error/Debug Address Capture Register */
#define XBAR_ARBITER2_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERRADDR*)0xF87000D0u)

/** Alias (User Manual Name) for XBAR_ARBITER2_ERRADDR.
* To use register names with standard convension, please use XBAR_ARBITER2_ERRADDR.
*/
#define	XBAR_ERRADDR2	(XBAR_ARBITER2_ERRADDR)

/** \\brief  C8, Arbiter Priority Register */
#define XBAR_ARBITER2_PRIOH /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOH*)0xF87000C8u)

/** Alias (User Manual Name) for XBAR_ARBITER2_PRIOH.
* To use register names with standard convension, please use XBAR_ARBITER2_PRIOH.
*/
#define	XBAR_PRIOH2	(XBAR_ARBITER2_PRIOH)

/** \\brief  CC, Arbiter Priority Register */
#define XBAR_ARBITER2_PRIOL /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOL*)0xF87000CCu)

/** Alias (User Manual Name) for XBAR_ARBITER2_PRIOL.
* To use register names with standard convension, please use XBAR_ARBITER2_PRIOL.
*/
#define	XBAR_PRIOL2	(XBAR_ARBITER2_PRIOL)

/** \\brief  144, Arbiter Control Register */
#define XBAR_ARBITER4_ARBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBCON*)0xF8700144u)

/** Alias (User Manual Name) for XBAR_ARBITER4_ARBCON.
* To use register names with standard convension, please use XBAR_ARBITER4_ARBCON.
*/
#define	XBAR_ARBCON4	(XBAR_ARBITER4_ARBCON)

/** \\brief  15C, Debug Address Register */
#define XBAR_ARBITER4_DBADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER4_DBADD*)0xF870015Cu)

/** Alias (User Manual Name) for XBAR_ARBITER4_DBADD.
* To use register names with standard convension, please use XBAR_ARBITER4_DBADD.
*/
#define	XBAR_DBADD4	(XBAR_ARBITER4_DBADD)

/** \\brief  158, Debug Control Register */
#define XBAR_ARBITER4_DBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_DBCON*)0xF8700158u)

/** Alias (User Manual Name) for XBAR_ARBITER4_DBCON.
* To use register names with standard convension, please use XBAR_ARBITER4_DBCON.
*/
#define	XBAR_DBCON4	(XBAR_ARBITER4_DBCON)

/** \\brief  160, Debug Mask Address Register */
#define XBAR_ARBITER4_DBMADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER4_DBMADD*)0xF8700160u)

/** Alias (User Manual Name) for XBAR_ARBITER4_DBMADD.
* To use register names with standard convension, please use XBAR_ARBITER4_DBMADD.
*/
#define	XBAR_DBMADD4	(XBAR_ARBITER4_DBMADD)

/** \\brief  154, Error/Debug Capture Register */
#define XBAR_ARBITER4_ERR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERR*)0xF8700154u)

/** Alias (User Manual Name) for XBAR_ARBITER4_ERR.
* To use register names with standard convension, please use XBAR_ARBITER4_ERR.
*/
#define	XBAR_ERR4	(XBAR_ARBITER4_ERR)

/** \\brief  150, Error/Debug Address Capture Register */
#define XBAR_ARBITER4_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERRADDR*)0xF8700150u)

/** Alias (User Manual Name) for XBAR_ARBITER4_ERRADDR.
* To use register names with standard convension, please use XBAR_ARBITER4_ERRADDR.
*/
#define	XBAR_ERRADDR4	(XBAR_ARBITER4_ERRADDR)

/** \\brief  148, Arbiter Priority Register */
#define XBAR_ARBITER4_PRIOH /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOH*)0xF8700148u)

/** Alias (User Manual Name) for XBAR_ARBITER4_PRIOH.
* To use register names with standard convension, please use XBAR_ARBITER4_PRIOH.
*/
#define	XBAR_PRIOH4	(XBAR_ARBITER4_PRIOH)

/** \\brief  14C, Arbiter Priority Register */
#define XBAR_ARBITER4_PRIOL /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOL*)0xF870014Cu)

/** Alias (User Manual Name) for XBAR_ARBITER4_PRIOL.
* To use register names with standard convension, please use XBAR_ARBITER4_PRIOL.
*/
#define	XBAR_PRIOL4	(XBAR_ARBITER4_PRIOL)

/** \\brief  184, Arbiter Control Register */
#define XBAR_ARBITER5_ARBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBCON*)0xF8700184u)

/** Alias (User Manual Name) for XBAR_ARBITER5_ARBCON.
* To use register names with standard convension, please use XBAR_ARBITER5_ARBCON.
*/
#define	XBAR_ARBCON5	(XBAR_ARBITER5_ARBCON)

/** \\brief  19C, Debug Address Register */
#define XBAR_ARBITER5_DBADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER5_DBADD*)0xF870019Cu)

