HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxXbar_reg.h
/** \\brief  210, Error/Debug Address Capture Register */
#define XBAR_ARBITER7_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERRADDR*)0xF8700210u)

/** Alias (User Manual Name) for XBAR_ARBITER7_ERRADDR.
* To use register names with standard convension, please use XBAR_ARBITER7_ERRADDR.
*/
#define	XBAR_ERRADDR7	(XBAR_ARBITER7_ERRADDR)

/** \\brief  208, Arbiter Priority Register */
#define XBAR_ARBITER7_PRIOH /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOH*)0xF8700208u)

/** Alias (User Manual Name) for XBAR_ARBITER7_PRIOH.
* To use register names with standard convension, please use XBAR_ARBITER7_PRIOH.
*/
#define	XBAR_PRIOH7	(XBAR_ARBITER7_PRIOH)

/** \\brief  20C, Arbiter Priority Register */
#define XBAR_ARBITER7_PRIOL /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOL*)0xF870020Cu)

/** Alias (User Manual Name) for XBAR_ARBITER7_PRIOL.
* To use register names with standard convension, please use XBAR_ARBITER7_PRIOL.
*/
#define	XBAR_PRIOL7	(XBAR_ARBITER7_PRIOL)

/** \\brief  244, Arbiter Control Register */
#define XBAR_ARBITER8_ARBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBCON*)0xF8700244u)

/** Alias (User Manual Name) for XBAR_ARBITER8_ARBCON.
* To use register names with standard convension, please use XBAR_ARBITER8_ARBCON.
*/
#define	XBAR_ARBCON8	(XBAR_ARBITER8_ARBCON)

/** \\brief  25C, Debug Address Register */
#define XBAR_ARBITER8_DBADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER8_DBADD*)0xF870025Cu)

/** Alias (User Manual Name) for XBAR_ARBITER8_DBADD.
* To use register names with standard convension, please use XBAR_ARBITER8_DBADD.
*/
#define	XBAR_DBADD8	(XBAR_ARBITER8_DBADD)

/** \\brief  258, Debug Control Register */
#define XBAR_ARBITER8_DBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_DBCON*)0xF8700258u)

/** Alias (User Manual Name) for XBAR_ARBITER8_DBCON.
* To use register names with standard convension, please use XBAR_ARBITER8_DBCON.
*/
#define	XBAR_DBCON8	(XBAR_ARBITER8_DBCON)

/** \\brief  260, Debug Mask Address Register */
#define XBAR_ARBITER8_DBMADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER8_DBMADD*)0xF8700260u)

/** Alias (User Manual Name) for XBAR_ARBITER8_DBMADD.
* To use register names with standard convension, please use XBAR_ARBITER8_DBMADD.
*/
#define	XBAR_DBMADD8	(XBAR_ARBITER8_DBMADD)

/** \\brief  254, Error/Debug Capture Register */
#define XBAR_ARBITER8_ERR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERR*)0xF8700254u)

/** Alias (User Manual Name) for XBAR_ARBITER8_ERR.
* To use register names with standard convension, please use XBAR_ARBITER8_ERR.
*/
#define	XBAR_ERR8	(XBAR_ARBITER8_ERR)

/** \\brief  250, Error/Debug Address Capture Register */
#define XBAR_ARBITER8_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERRADDR*)0xF8700250u)

/** Alias (User Manual Name) for XBAR_ARBITER8_ERRADDR.
* To use register names with standard convension, please use XBAR_ARBITER8_ERRADDR.
*/
#define	XBAR_ERRADDR8	(XBAR_ARBITER8_ERRADDR)

/** \\brief  248, Arbiter Priority Register */
#define XBAR_ARBITER8_PRIOH /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOH*)0xF8700248u)

/** Alias (User Manual Name) for XBAR_ARBITER8_PRIOH.
* To use register names with standard convension, please use XBAR_ARBITER8_PRIOH.
*/
#define	XBAR_PRIOH8	(XBAR_ARBITER8_PRIOH)

/** \\brief  24C, Arbiter Priority Register */
#define XBAR_ARBITER8_PRIOL /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOL*)0xF870024Cu)

/** Alias (User Manual Name) for XBAR_ARBITER8_PRIOL.
* To use register names with standard convension, please use XBAR_ARBITER8_PRIOL.
*/
#define	XBAR_PRIOL8	(XBAR_ARBITER8_PRIOL)

/** \\brief  284, Arbiter Control Register */
#define XBAR_ARBITER9_ARBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBCON*)0xF8700284u)

/** Alias (User Manual Name) for XBAR_ARBITER9_ARBCON.
* To use register names with standard convension, please use XBAR_ARBITER9_ARBCON.
*/
#define	XBAR_ARBCON9	(XBAR_ARBITER9_ARBCON)

/** \\brief  29C, Debug Address Register */
#define XBAR_ARBITER9_DBADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER9_DBADD*)0xF870029Cu)

/** Alias (User Manual Name) for XBAR_ARBITER9_DBADD.
* To use register names with standard convension, please use XBAR_ARBITER9_DBADD.
*/
#define	XBAR_DBADD9	(XBAR_ARBITER9_DBADD)

/** \\brief  298, Debug Control Register */
#define XBAR_ARBITER9_DBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_DBCON*)0xF8700298u)

/** Alias (User Manual Name) for XBAR_ARBITER9_DBCON.
* To use register names with standard convension, please use XBAR_ARBITER9_DBCON.
*/
#define	XBAR_DBCON9	(XBAR_ARBITER9_DBCON)

/** \\brief  2A0, Debug Mask Address Register */
#define XBAR_ARBITER9_DBMADD /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBITER9_DBMADD*)0xF87002A0u)

/** Alias (User Manual Name) for XBAR_ARBITER9_DBMADD.
* To use register names with standard convension, please use XBAR_ARBITER9_DBMADD.
*/
#define	XBAR_DBMADD9	(XBAR_ARBITER9_DBMADD)

/** \\brief  294, Error/Debug Capture Register */
#define XBAR_ARBITER9_ERR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERR*)0xF8700294u)

/** Alias (User Manual Name) for XBAR_ARBITER9_ERR.
* To use register names with standard convension, please use XBAR_ARBITER9_ERR.
*/
#define	XBAR_ERR9	(XBAR_ARBITER9_ERR)

/** \\brief  290, Error/Debug Address Capture Register */
#define XBAR_ARBITER9_ERRADDR /*lint --e(923)*/ (*(volatile Ifx_XBAR_ERRADDR*)0xF8700290u)

/** Alias (User Manual Name) for XBAR_ARBITER9_ERRADDR.
* To use register names with standard convension, please use XBAR_ARBITER9_ERRADDR.
*/
#define	XBAR_ERRADDR9	(XBAR_ARBITER9_ERRADDR)

/** \\brief  288, Arbiter Priority Register */
#define XBAR_ARBITER9_PRIOH /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOH*)0xF8700288u)

/** Alias (User Manual Name) for XBAR_ARBITER9_PRIOH.
* To use register names with standard convension, please use XBAR_ARBITER9_PRIOH.
*/
#define	XBAR_PRIOH9	(XBAR_ARBITER9_PRIOH)

/** \\brief  28C, Arbiter Priority Register */
#define XBAR_ARBITER9_PRIOL /*lint --e(923)*/ (*(volatile Ifx_XBAR_PRIOL*)0xF870028Cu)

/** Alias (User Manual Name) for XBAR_ARBITER9_PRIOL.
* To use register names with standard convension, please use XBAR_ARBITER9_PRIOL.
*/
#define	XBAR_PRIOL9	(XBAR_ARBITER9_PRIOL)

/** \\brief  4, Arbiter Control Register */
#define XBAR_ARBITERD_ARBCON /*lint --e(923)*/ (*(volatile Ifx_XBAR_ARBCON*)0xF8700004u)

